app/Http/Livewire/Admin/Feedbacks.php

  public function render()
  {
    $comments = Report::paginate($this->per_page);
---
select count(*) as aggregate from `reports`