app/Http/Livewire/Admin/Home.php

select count(*) as aggregate from `orders` where `order_status` = 'pending'
select count(*) as aggregate from `orders` where `order_status` = 'processing'
select count(*) as aggregate from `orders` where `order_status` = 'cancelled'
select count(*) as aggregate from `orders` where `order_status` = 'completed'
select count(*) as aggregate from `pick_ups` where `pickup_status` = 'pending'
select count(*) as aggregate from `pick_ups` where `pickup_status` = 'cancelled'
select count(*) as aggregate from `pick_ups` where `pickup_status` = 'completed'
---
  public function mount()
  {

    $this->totalOrders = Order::all()->count();
    $this->pendingOrders = Order::where('order_status', 'pending')->count();
    $this->processingOrders = Order::where('order_status', 'processing')->count();
    $this->cancelledOrders = Order::where('order_status', 'cancelled')->count();
    $this->completedOrders = Order::where('order_status', 'completed')->count();

    $this->pendingPickups = PickUp::where('pickup_status', 'pending')->count();
    $this->cancelledPickups = PickUp::where('pickup_status','cancelled')->count();
    $this->completedPickups = PickUp::where('pickup_status', 'completed')->count();

select sum(`total_cost`) as aggregate from `invoices`
select sum(`paid_amount`) as aggregate from `invoices` where `invoice_type` in ('standard', 'debit')
select sum(total_cost - paid_amount) as aggregate from `invoices` where `invoice_type` in ('debit') and `total_cost` > paid_amount
select sum(`total_cost`) as aggregate from `invoices` where `invoice_type` in ('credit')
---
  public function render()
  {
    $total_cost = Invoice::sum('total_cost');
    $totalStandardCost = Invoice::whereIn('invoice_type', ['standard', 'debit'])
    ->sum('paid_amount');
    $debitTotalCost = Invoice::whereIn('invoice_type', ['debit'])
    ->where('total_cost', '>', DB::raw('paid_amount'))
    ->sum(DB::raw('total_cost - paid_amount'));
    $creditTotalCost = Invoice::whereIn('invoice_type', ['credit'])->sum('total_cost');