app/Http/Livewire/Admin/Orders.php

  public function render()
  {
    $orders = Order::query()
    ->when($this->selectedBranch != 'all', function ($query) {
        $query->where('branch_id', $this->selectedBranch);
    })
    ->when($this->search, function ($query) {
        $query->where(function ($query) {
            $query->where('order_id', 'LIKE', '%' . $this->search . '%')
                ->orWhere('customer_name', 'LIKE', '%' . $this->search . '%')
                ->orWhere('payment_status', 'LIKE', '%' . $this->search . '%')
                ->orWhere('order_status', 'LIKE', '%' . $this->search . '%');
        });
    })
    ->paginate($this->per_page);
---
select count(*) as aggregate from `orders`

      ];
    }

    $branches = Branch::all();
---
select * from `branches`