app/Http/Livewire/Admin/Staffs.php

  public function render()
  {
    $branches = Branch::all();
    $staffs = Staff::paginate($this->per_page);
---
select * from `branches`
select * from `staffs` limit 15 offset 0
select count(*) as aggregate from `staffs`