app/Http/Livewire/Staff/CreateItem.php

select count(*) as aggregate from `items` inner join `categories` on `items`.`category_id` = `categories`.`id`
select `items`.*, `categories`.`name` as `category_name` from `items` inner join `categories` on `items`.`category_id` = `categories`.`id` order by `created_at` asc limit 10 offset 0
select * from `categories`
---
    public function render()
    {
      $items = DB::table('items')
            ->join('categories', 'items.category_id', '=', 'categories.id')
            ->select('items.*', 'categories.name as category_name')
            ->orderBy('created_at','asc')
            ->paginate($this->per_page);

      return view('livewire.staff.create-item', [
        'items' => $items,
        'categories' => Category::all(),
      ]);