app/Http/Livewire/Staff/Customers.php

select * from `customers` order by `firstname` asc limit 5 offset 0
select count(*) as aggregate from `customers`
---
  public function render()
  {
    $customers = $this->search
            ? Customer::where('firstname', 'like', '%'.$this->search.'%')
                      ->orWhere('lastname', 'like', '%'.$this->search.'%')
                      ->orWhere('email', 'like', '%'.$this->search.'%')
                      ->orderBy('firstname')
                      ->paginate($this->per_page)
            : Customer::orderBy('firstname')
                      ->paginate($this->per_page);