app/Http/Livewire/Staff/GenerateInvoice.php

select `items`.*, `categories`.`name` as `category_name` from `items` left join `categories` on `categories`.`id` = `items`.`category_id` order by `items`.`name` asc
select * from `categories`
---
  public function render()
  {
    $cartNumber = $this->cart;

    $items = DB::table('items')
                ->select('items.*', 'categories.name as category_name')
                ->leftJoin('categories', 'categories.id', '=', 'items.category_id')
                ->orderBy('items.name')
                ->get();

    $categories = Category::all();