app/Http/Livewire/Staff/Home.php

  public function mount()
  {
    $user_id = auth()->user()->id; // get auth user

    $staff = Staff::where('staff_id', $user_id)->first(); // get staff
    // dd($user_id);
    $branch_id = $staff->branch_id; //get branch


    $this->totalOrders = Order::where('branch_id', $branch_id)->count();
    $this->pendingOrders = Order::where('branch_id', $branch_id)->where('order_status', 'pending')->count();
    $this->processingOrders = Order::where('branch_id', $branch_id)->where('order_status', 'processing')->count();
    $this->cancelledOrders = Order::where('branch_id', $branch_id)->where('order_status', 'cancelled')->count();
    $this->completedOrders = Order::where('branch_id', $branch_id)->where('order_status', 'completed')->count();

    $this->pendingPickups = Pickup::where('branch_id', $staff->branch_id)->where('pickup_status', 'pending')->count();
    $this->cancelledPickups = Pickup::where('branch_id', $staff->branch_id)->where('pickup_status','cancelled')->count();
    $this->completedPickups = Pickup::where('branch_id', $staff->branch_id)->where('pickup_status', 'completed')->count();

    $this->totalPickups = PickUp::where('branch_id', $staff->branch_id)->count();
---
select * from `staffs` where `staff_id` = 2 limit 1
select count(*) as aggregate from `orders` where `branch_id` = 2
select count(*) as aggregate from `orders` where `branch_id` = 2 and `order_status` = 'pending'
select count(*) as aggregate from `orders` where `branch_id` = 2 and `order_status` = 'processing'
select count(*) as aggregate from `orders` where `branch_id` = 2 and `order_status` = 'cancelled'
select count(*) as aggregate from `orders` where `branch_id` = 2 and `order_status` = 'completed'
select count(*) as aggregate from `pick_ups` where `branch_id` = 2 and `pickup_status` = 'pending'
select count(*) as aggregate from `pick_ups` where `branch_id` = 2 and `pickup_status` = 'cancelled'
select count(*) as aggregate from `pick_ups` where `branch_id` = 2 and `pickup_status` = 'completed'
select count(*) as aggregate from `pick_ups` where `branch_id` = 2