app/Http/Livewire/Staff/Invoices.php

  public function invoiceView($invoiceId)
  {

    $invoice = Invoice::where('invoice_id', $invoiceId)->first();
---
select * from `invoices` where `invoice_id` = 2817303 limit 1

  public function render()
  {
    $user_id = auth()->user()->id; // get auth user
    $staff = Staff::where('staff_id', $user_id)->first(); // get staff
    $branch_id = $staff->branch_id; //get branch

    // $invoices = Invoice::where('branch_id', $branch_id)->paginate($this->per_page);

    $invoices = $this->search
    ? Invoice::where(function($query) use ($staff) {
      $query->where('invoice_id', 'like', '%'.$this->search.'%')
            ->orWhere('invoice_type','like', '%'.$this->search.'%')
            ->orWhere('payment_method','like', '%'.$this->search.'%')
            ->where('customer_name', $staff->branch_id);
      })
      ->paginate($this->per_page)
      :Invoice::where('branch_id', $staff->branch_id)
        ->orderBy('created_at', 'desc')
        ->paginate($this->per_page);

    if($this->fromDate && $this->toDate){
      $invoiceQuery = Invoice::where('branch_id', $branch_id);
      $invoices = $invoiceQuery->whereBetween('created_at',[$this->fromDate, $this->toDate])->paginate($this->per_page);
---
select * from `staffs` where `staff_id` = 2 limit 1
select * from `invoices` where `branch_id` = 2 order by `created_at` desc limit 25 offset 0
select count(*) as aggregate from `invoices` where `branch_id` = 2
select count(*) as aggregate from `invoices` where `branch_id` = 2 and `created_at` between '2023-06-14' and '2023-06-28'