app/Http/Livewire/Staff/InvoiceSearch.php

select * from `invoices` where `invoice_id` = '2890013' limit 1
select * from `customers` where `customer_id` = 2 limit 1
select * from `branches` where `id` = 2 limit 1
select * from `orders` where `order_id` = '2890013' limit 1
---
  public function searchInvoice()
  {
    $validatedData = $this->validate([
      'invoiceNumber' => ['required', 'numeric', 'digits_between:5,8', Rule::in([$this->invoiceNumber])]
    ]);

    $invoice = Invoice::where('invoice_id', $validatedData['invoiceNumber'])->first();

    if($invoice){
      $this->invoice = $invoice;
      $this->invoiceAvailable = true;
      $this->searchPerformed= true;
      $this->customer = Customer::where('customer_id', $invoice->user_id)->first();
      $this->branch = Branch::where('id', $invoice->branch_id)->first();
      $this->order = Order::where('order_id', $invoice->invoice_id)->first();