app/Http/Livewire/Staff/ViewGeneratedInvoice.php

select * from `branches` where `id` = 2 limit 1
---
  public function invoiceView()
  {

    $invoice_info = Session::get('invoice_id');

    if($invoice_info){
      $this->invoice = $invoice_info;
      $branch = Branch::where('id', $invoice_info->branch_id)->first();